{
  "name": "Andrei Zotov",
  "introduction": "I'm Andrei Zotov",
  "frontEndDeveloper": "Front-End Developer",
  "descriptionAboutMe": "Web-applications front-end developer with 4 years of experience. I have experience in commercial Development of both small and large projects. I am engaged in development Front-end part of web applications in the JavaScript language in conjunction with the React.",
  "age": "Age",
  "residence": "Residence",
  "russia": "Russia",
  "currentLocation": "Current Location",
  "belgrade": "Belgrade",
  "languages": "Languages",
  "russian": "Russian",
  "english": "English",
  "skills": "Skills",
  "extraSkills": "Extra Skills",
  "portfolio": "Portfolio",
  "workHistory": "Work history",
  "gravis": {
    "participated": "Completed tasks within the project: \n\t- Full participation in team development, following GitFlow methodology; \n\t- Global layout changes according to layouts in Figma; \n\t- Implementing logic via Redux, Web3 and connecting smart contracts; \n\t- Integration with various crypto wallets; \n\t- Developing charts for exchange analytics; \n\t- Adding multilanguage system; \n\t- Working with SVG icons and their animations; \n\t- Using storybook for creating and testing uikit."
  },
  "frfi": {
    "participated": "Completed tasks within the project: \n\t- Implementing logic via Redux, Web3 and connecting smart contracts; \n\t- Implemented switching between light and dark theme; \n\t- Full participation in team development, following GitFlow methodology; \n\t- Global layout changes according to layouts in Figma; \n\t- Integration with various crypto wallets; \n\t- Developing charts for different tokens; \n\t- Working with SVG icons and their animations; \n\t- Creating system with deep implementing redux and redux-thunk with redux persist.\n\t- Multiple underlying calculations for backend to keep the front load and work as fast as possible."
  },
  "erp": {
    "participated": "Completed tasks within the project: \n\t- Refinement of the \"Tasks\" section, for setting, viewing, editing, and adding files to tasks by the users of the system; \n\t- Development of the \"Leads\" section, for the automated collection of requests from freelance exchanges and its further processing inside the company, using the self-written solution of pagination and filtration. \n\t- Development of messaging section using WebSockets; \n\t- Development of the \"Daily reports of the developer\" section about the work done for the day with pulling commits from the corporate server GitLab; \n\t- Development of the \"Users\" section for adding and editing users with different access roles; \n\t- Working with localStorage and cookie files to store the Redux state and data user authorization;"
  },
  "portfolioItems": {
    "frfi": "Took part in the finalization of smart contracts based on the mechanism of auto-investment (autofarming) of user funds through a standard farming from different dexes. Created the system of creating conditions for Safe Farming mechanism, which provides withdrawal or deposit of user's funds depending on the price of one or another token and suggests the possibility of splitting the deposited LP token into two different ones. Also participated in creating a list of tokens with the ability to view the history of price changes and the implementation of AI token price prediction. Developed a system where user token balances were taken from different chains. Developed systems for approves and signatures to deposit any available user token into the desired pool, as well as calculating the price impact for the selected token.",
    "gravis": "Took part in the redesign and development of the mechanisms of our own DEX. Developed solutions and made calculations for the accrual of user rewards. Created interfaces for the space game Evervoid using NFT. Optimized performance of received data from public RPC nodes, improving speed and reliability of information processing. Experienced in implementing cross-chain linking technology to simplify interactions between different blockchains. Developed an NFT marketplace involving gaming items as well as hosting NFT tokens of our partners. Reworked Farming from another exchange adding Autofarming mechanisms. Participated in the development of a steering system for in-game NFTs, providing additional motivation for long-term retention of assets. Integrated smart contracts to ensure transaction security and guarantee execution of transaction terms on the platform. Implemented an adaptive interface for the DEX exchange, taking into account the specifics of using different devices and screens to ensure user convenience and comfort. Developed modular architecture for the front-end, ensuring flexibility and scalability of implementing new features and components. Used modern frameworks and tools, such as React and Next.js, to create high-performance and responsive user interfaces that meet audience needs and market demands.",
    "kotelov": "As part of the project to implement an employee monitoring tool for the construction company Brusnika, a unique resource management and task control system was created. The system allowed to categorize expenses by items, optimize payroll allocation, and control budget execution. For the convenience of employees, a personal office was developed with integration of login through a Google account and Google Calendar connection for easy tracking of colleagues' birthdays and planning corporate events. In addition to work schedule, company news was available in the employee's office, providing prompt information about important events and changes within the organization. Such a system made it possible to increase work efficiency, simplify communication between employees and improve control over the company's expenses and budget.",
    "sixhands": "While working for this company, I participated in the development of such a project as an ERP system, which included primarily a Kanban task board that was divided into different Workspaces that each user could create to distribute tasks to specific projects. For the tasks themselves, it was possible to assign an executor and a verifier, add comments, photos or videos, set a priority and category, and set a deadline. There was also a user page which displayed a list of all the tasks that had been set for it, this page had filtering by all possible fields on the task with the filters being saved when the page was reloaded. There was a section with the user's daily reports, where each employee had to mark what he did for the day and on which project. There was a Leads section where advertisements from various freelance exchanges were delivered. It was possible to generate estimates and communicate with the customer through a single interface, also assigning managers to the taken projects. There were also sections with users, where it was possible to change all the data of a single user and a section with the Knowledge Base of the company, where the most important articles were located. I was also involved in a project at this company to develop a video player for interactive cinema. This player implemented seamless switching between different videos, voice recording and processing functionality via Speech-to-text and subsequent selection of the necessary track depending on the user's response. A video editor was also developed to edit the behavior of the interactive movie, where you could arrange the branches of viewing behavior."
  },
  "downloadResume": "Download Resume"
}
