{
  "name": "Андрей Зотов",
  "introduction": "Меня зовут Андрей Зотов",
  "frontEndDeveloper": "Front-End Разработчик",
  "descriptionAboutMe": "Front-end разработчик веб-приложений с 4-летним опытом работы. Имею опыт коммерческой Разработки как небольших, так и крупных проектов. Занимаюсь разработкой Front-end части веб-приложений на языке JavaScript в связке с React.",
  "age": "Возраст",
  "residence": "Резидентство",
  "russia": "Россия",
  "currentLocation": "Местоположение",
  "belgrade": "Санкт-Петербург",
  "languages": "Языки",
  "russian": "Русский",
  "english": "Английский",
  "skills": "Навыки",
  "extraSkills": "Дополнительные навыки",
  "portfolio": "Портфолио",
  "workHistory": "Опыт работы",
  "gravis": {
    "participated": "Выполненные задачи в рамках проекта: \n\t- Полное участие в командной разработке, следуя методологии GitFlow; \n\t- Глобальная переработка верстки по макетам из Figma; \n\t- Реализация логики с помощью Redux, Web3 и подключение смарт-контрактов; \n\t- Интеграция различных криптовалютных кошельков; \n\t- Разработка графиков для биржевой аналитики; \n\t- Добавление мультиязычной системы; \n\t- Работа с иконками SVG и их анимацией; \n\t- Использование storybook для создания и тестирования uikit."
  },
  "frfi": {
    "participated": "Выполненные задачи в рамках проекта: \n\t- Реализация логики с помощью Redux, Web3 и подключение смарт-контрактов; \n\t- Реализовано переключение между светлой и темной темой; \n\t- Полное участие в командной разработке, следуя методологии GitFlow; \n\t- Глобальный макет изменяется в соответствии с макетами в Figma; \n\t- Интеграция различных криптовалютных кошельков; \n\t- Разработка графиков для различных токенов; \n\t- Работа с иконками SVG и их анимацией; \n\t- Создание системы с глубокой реализацией redux и redux-thunk с redux persist.\n\t- Множество базовых вычислений для бэкенда, чтобы сохранить нагрузку на фронт и работать как можно быстрее."
  },
  "erp": {
    "participated": "Выполненные задачи в рамках проекта: \n\t- Доработка раздела \"Задачи\", для установки, просмотра, редактирования и добавления файлов в задачи пользователями системы; \n\t- Разработка раздела \"Лиды\", для автоматизированного сбора заявок с бирж фриланса и дальнейшей их обработки внутри компании, с использованием самописного решения пагинации и фильтрации. \n\t- Разработка секции обмена сообщениями с использованием WebSockets; \n\t- Разработка раздела \"Ежедневные отчеты разработчика\" о проделанной за день работе с подтягиванием коммитов с корпоративного сервера GitLab; \n\t- Разработка раздела \"Пользователи\" для добавления и редактирования пользователей с различными ролями доступа; \n\t- Работа с localStorage и файлами cookie для хранения состояния Redux и данных авторизации пользователя;"
  },
  "portfolioItems": {
    "frfi": "Принимал участие в доработке смарт-контрактов на основе механизма автоинвестирования (автофарминга) средств пользователя посредством стандартного ферминга из разных дексов. Создал систему создания условий для механизма Safe Farming, который обеспечивает вывод или ввод средств пользователя в зависимости от цены того или иного токена и предполагает возможность разделения депонированного токена LP на два разных. Также участвовал в создании списка токенов с возможностью просмотра истории изменения цены и реализации AI прогнозирования цены токенов. Разработал систему, в которой балансы токенов пользователей брались из разных цепочек. Разработал системы одобрения и подписи для внесения любого доступного пользовательского токена в нужный пул, а также расчета влияния на цену выбранного токена.",
    "gravis": "Принимал участие в редизайне и разработке механизмов собственного DEX. Разрабатывал решения и производил расчеты для начисления вознаграждений пользователей. Создал интерфейсы для космической игры Evervoid с использованием NFT. Оптимизировал производительность получаемых данных от публичных RPC-узлов, повышая скорость и надежность обработки информации. Имеет опыт внедрения технологии межцепочечного связывания для упрощения взаимодействия между различными блокчейнами. Разработал NFT-маркетплейс, включающий игровые товары, а также хостинг NFT-токенов наших партнеров. Переработал Farming с другой биржи, добавив механизмы Autofarming. Участвовали в разработке системы управления внутриигровыми NFT, обеспечивающей дополнительную мотивацию для долгосрочного хранения активов. Интегрировали смарт-контракты для обеспечения безопасности транзакций и гарантии выполнения условий сделок на платформе. Реализовал адаптивный интерфейс для биржи DEX, учитывающий особенности использования различных устройств и экранов для обеспечения удобства и комфорта пользователей. Разработали модульную архитектуру для front-end, обеспечивающую гибкость и масштабируемость внедрения новых функций и компонентов. Использовали современные фреймворки и инструменты, такие как React и Next.js, для создания высокопроизводительных и отзывчивых пользовательских интерфейсов, отвечающих потребностям аудитории и требованиям рынка.",
    "kotelov": "В рамках проекта по внедрению инструмента мониторинга сотрудников для строительной компании \"Брусника\" была создана уникальная система управления ресурсами и контроля задач. Система позволила классифицировать расходы по статьям, оптимизировать распределение заработной платы и контролировать исполнение бюджета. Для удобства сотрудников был разработан личный кабинет с интеграцией входа через аккаунт Google и подключением Google Calendar для удобного отслеживания дней рождения коллег и планирования корпоративных мероприятий. Помимо рабочего графика, в кабинете сотрудника были доступны новости компании, оперативно информирующие о важных событиях и изменениях в организации. Такая система позволила повысить эффективность работы, упростить общение между сотрудниками и улучшить контроль над расходами и бюджетом компании.",
    "sixhands": "Работая в этой компании, я участвовал в разработке такого проекта, как ERP-система, которая включала в себя, прежде всего, доску задач Kanban, разделенную на различные рабочие пространства, которые каждый пользователь мог создавать для распределения задач по конкретным проектам. Для самих задач можно было назначить исполнителя и проверяющего, добавить комментарии, фото или видео, установить приоритет и категорию, а также срок выполнения. Также была страница пользователя, на которой отображался список всех задач, которые были поставлены перед ним. На этой странице была предусмотрена фильтрация по всем возможным полям задачи с сохранением фильтров при перезагрузке страницы. Имелся раздел с ежедневными отчетами пользователя, где каждый сотрудник должен был отметить, что он сделал за день и по какому проекту. Имелся раздел Leads, куда поступали объявления с различных бирж фриланса. Можно было составлять сметы и общаться с заказчиком через единый интерфейс, также назначая менеджеров на взятые проекты. Также были разделы с пользователями, где можно было изменять все данные одного пользователя, и раздел с базой знаний компании, где размещались самые важные статьи. В этой компании я также участвовал в проекте по разработке видеоплеера для интерактивного кинотеатра. В этом плеере было реализовано плавное переключение между различными видео, функция записи и обработки голоса через Speech-to-text и последующий выбор необходимой дорожки в зависимости от реакции пользователя. Также был разработан видеоредактор для редактирования поведения интерактивного фильма, в котором можно было организовать ветви поведения просмотра.",
    "spiks": "Принимал участие в разработке образовательной платформы с размещением курсов пользоваталей. Разрабатывал систему публикации видеоконтента. \"Реклама\" для CRM системы покупки и аренды недвижимости. Работал с Next.js 12 версии, а также со state менеджером Effector"
  },
  "downloadResume": "Скачать резюме",
  "portfolioItemsDescriptions": {
    "frfi": "Фарминг токенов с использованием ИИ",
    "gravis": "Экосистема, объединяющая платформу DeFi, торговую площадку NFT и игру Evervoid",
    "kotelov": "Система редактирования для управления данными о сотрудниках",
    "interactivePlayer": "Видеоплеер для воспроизведения интерактивных фильмов",
    "erp": "Планирование ресурсов предприятия (ERP) для организации",
    "telegramBots": "Список проектов, построенных на API Telegram"
  }
}
